In [2]:
import pandas as pd

In [ ]:
# 2 main pandas structures

#Series
#dataframes

In [4]:
#SERIES

import pandas as pd
data= [10,20,30,40]

series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
import pandas as pd

data = ['Tanaji', 'More', "Jaipur"]

series = pd.Series(data)
print(series)

0    Tanaji
1      More
2    Jaipur
dtype: str

In [7]:
#Data Frames

import pandas as pd

data = {
    "Name": ["Tanaji", "Amit", "Sidhu"],
    "Age": [22,23,21],
    "City": ["Pune", "Mumbai", "Sangola"]
}

df = pd.DataFrame(data)
print(df)

     Name  Age     City
0  Tanaji   22     Pune
1    Amit   23   Mumbai
2   Sidhu   21  Sangola

In [11]:
# Read CSV File (MOST USED)

import pandas as pd

df = pd.read_csv("data.csv")

print(df)

     Name  Age  Salary
0  Tanaji   25   50000
1   Rahul   30   60000
2    Amit   28   55000
3  Yogesh   30   20400
4    Akki   21   45990
5   Sidhu   24  100000
6    Joan   24   34500
7    Mike   45   55000
8    Cena   34   45000

In [21]:
# View Data
#first 5 rows

import pandas as pd

df = pd.read_csv("data.csv")

df.head() # first 5 record

     Name  Age  Salary
0  Tanaji   25   50000
1   Rahul   30   60000
2    Amit   28   55000
3  Yogesh   30   20400
4    Akki   21   45990

In [22]:
df.tail()

    Name  Age  Salary
4   Akki   21   45990
5  Sidhu   24  100000
6   Joan   24   34500
7   Mike   45   55000
8   Cena   34   45000

In [23]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='str')

In [25]:
df.describe()

             Age         Salary
count   9.000000       9.000000
mean   29.000000   51765.555556
std     7.193747   21735.441743
min    21.000000   20400.000000
25%    24.000000   45000.000000
50%    28.000000   50000.000000
75%    30.000000   55000.000000
max    45.000000  100000.000000

In [26]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    9 non-null      str
 1   Age     9 non-null      int64
 2   Salary  9 non-null      int64
dtypes: int64(2), str(1)
memory usage: 348.0 bytes

In [ ]:
df["Name"] # Single column

0    Tanaji
1     Rahul
2      Amit
3    Yogesh
4      Akki
5     Sidhu
6      Joan
7      Mike
8      Cena
Name: Name, dtype: str

In [31]:

#Multiple columns
df[["Name","Age"]]

     Name  Age
0  Tanaji   25
1   Rahul   30
2    Amit   28
3  Yogesh   30
4    Akki   21
5   Sidhu   24
6    Joan   24
7    Mike   45
8    Cena   34

In [34]:
# Select Rows - Specific

df.loc[2]

Name       Amit
Age          28
Salary    55000
Name: 2, dtype: object

In [35]:
df.loc[0:2]

     Name  Age  Salary
0  Tanaji   25   50000
1   Rahul   30   60000
2    Amit   28   55000

In [39]:
#Filter Data (VERY IMPORTANT)

df[df['Salary'] >= 50000]

     Name  Age  Salary
0  Tanaji   25   50000
1   Rahul   30   60000
2    Amit   28   55000
5   Sidhu   24  100000
7    Mike   45   55000

In [41]:
#Add New Column

df["Bonus"] = df["Salary"] * 0.10
print(df)

     Name  Age  Salary    Bonus
0  Tanaji   25   50000   5000.0
1   Rahul   30   60000   6000.0
2    Amit   28   55000   5500.0
3  Yogesh   30   20400   2040.0
4    Akki   21   45990   4599.0
5   Sidhu   24  100000  10000.0
6    Joan   24   34500   3450.0
7    Mike   45   55000   5500.0
8    Cena   34   45000   4500.0

In [43]:
# Basic Analysis
# Average salary
df["Salary"].mean()

np.float64(51765.555555555555)

In [44]:
# Maximum salary
df["Salary"].max()

np.int64(100000)

In [59]:
import pandas as pd
# Read file
df = pd.read_csv("employees.csv")
print(df)

# Show first 3 rows
print(df[0:3])

# Show only Name and Salary columns
print(df[['Name','Salary']])

#Avg salary
df["Salary"].mean()

#Filter employees with Salary > 52000
df[df["Salary"] >52000]

     Name  Age  Salary    City
0  Tanaji   25   50000    Pune
1   Rahul   30   60000  Mumbai
2    Amit   28   55000   Delhi
3   Priya   27   52000    Pune
     Name  Age  Salary    City
0  Tanaji   25   50000    Pune
1   Rahul   30   60000  Mumbai
2    Amit   28   55000   Delhi
     Name  Salary
0  Tanaji   50000
1   Rahul   60000
2    Amit   55000
3   Priya   52000

    Name  Age  Salary    City
1  Rahul   30   60000  Mumbai
2   Amit   28   55000   Delhi